vmux0.0.11/ycsbVMs_ycsb_16vms_vmux-emu_-1rps_rep0/vm1.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-02-05 01:34:13:907 0 sec: 0 operations; est completion in 0 second 
2025-02-05 01:34:23:748 10 sec: 27452 operations; 2744.93 current ops/sec; est completion in 1 day 19 hours [READ: Count=13615, Max=13063, Min=195, Avg=348.49, 90=405, 99=3479, 99.9=4227, 99.99=7411] [UPDATE: Count=13840, Max=24447, Min=201, Avg=353.22, 90=405, 99=3481, 99.9=4231, 99.99=7639] 
2025-02-05 01:34:33:749 20 sec: 60020 operations; 3256.47 current ops/sec; est completion in 1 day 15 hours [READ: Count=16289, Max=8631, Min=195, Avg=306.35, 90=392, 99=517, 99.9=695, 99.99=3787] [UPDATE: Count=16276, Max=4835, Min=198, Avg=300.51, 90=389, 99=517, 99.9=634, 99.99=3829] 
2025-02-05 01:34:43:748 30 sec: 92697 operations; 3268.03 current ops/sec; est completion in 1 day 14 hours [READ: Count=16347, Max=3813, Min=195, Avg=305.17, 90=391, 99=518, 99.9=686, 99.99=2765] [UPDATE: Count=16330, Max=8815, Min=194, Avg=302.45, 90=388, 99=517, 99.9=660, 99.99=3709] 
2025-02-05 01:34:53:748 40 sec: 122639 operations; 2994.2 current ops/sec; est completion in 1 day 14 hours [READ: Count=14881, Max=4071, Min=199, Avg=332.18, 90=432, 99=566, 99.9=763, 99.99=3757] [UPDATE: Count=15061, Max=4023, Min=201, Avg=330.65, 90=431, 99=559, 99.9=765, 99.99=3873] 
2025-02-05 01:35:03:748 50 sec: 154747 operations; 3210.8 current ops/sec; est completion in 1 day 14 hours [READ: Count=16025, Max=3229, Min=197, Avg=310.75, 90=400, 99=521, 99.9=588, 99.99=2853] [UPDATE: Count=16083, Max=5655, Min=194, Avg=308.17, 90=399, 99=522, 99.9=610, 99.99=2635] 
2025-02-05 01:35:13:748 60 sec: 187193 operations; 3244.6 current ops/sec; est completion in 1 day 14 hours [READ: Count=16261, Max=1454, Min=196, Avg=307.56, 90=395, 99=513, 99.9=583, 99.99=781] [UPDATE: Count=16185, Max=5847, Min=199, Avg=304.93, 90=393, 99=517, 99.9=608, 99.99=3579] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-02-05 01:35:14:756 61 sec: 190502 operations; 3282.74 current ops/sec; est completion in 1 day 14 hours [READ: Count=1688, Max=677, Min=198, Avg=305.16, 90=400, 99=497, 99.9=595, 99.99=677] [CLEANUP: Count=1, Max=1177, Min=1177, Avg=1177, 90=1177, 99=1177, 99.9=1177, 99.99=1177] [UPDATE: Count=1621, Max=3549, Min=196, Avg=298.96, 90=395, 99=485, 99.9=606, 99.99=3549] 
[OVERALL], RunTime(ms), 61015
[OVERALL], Throughput(ops/sec), 3122.2158485618293
[TOTAL_GCS_Copy], Count, 17
[TOTAL_GC_TIME_Copy], Time(ms), 20
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03277882487912809
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 17
[TOTAL_GC_TIME], Time(ms), 20
[TOTAL_GC_TIME_%], Time(%), 0.03277882487912809
[READ], Operations, 95106
[READ], AverageLatency(us), 317.1489495930856
[READ], MinLatency(us), 195
[READ], MaxLatency(us), 13063
[READ], 95thPercentileLatency(us), 444
[READ], 99thPercentileLatency(us), 539
[READ], Return=OK, 95106
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1177.0
[CLEANUP], MinLatency(us), 1177
[CLEANUP], MaxLatency(us), 1177
[CLEANUP], 95thPercentileLatency(us), 1177
[CLEANUP], 99thPercentileLatency(us), 1177
[UPDATE], Operations, 95396
[UPDATE], AverageLatency(us), 315.26188729087175
[UPDATE], MinLatency(us), 194
[UPDATE], MaxLatency(us), 24447
[UPDATE], 95thPercentileLatency(us), 441
[UPDATE], 99thPercentileLatency(us), 542
[UPDATE], Return=OK, 95396
AUTOTEST_DONE